views/user/index.php

            <?php
            if ($user->id == Yii::$app->user->id) {
                $query = Message::find();
                $count = $query->where(['status' => Message::STATUS_UNREADED])
                        ->andWhere(['recipient_id' => Yii::$app->user->id])
                        ->count();
---
SELECT COUNT(*) FROM `message` WHERE (`status`=0) AND (`recipient_id`=1)