models/Email.php

SELECT * FROM `email` WHERE `id`=2
---
    public static function findById($id) {
        return static::findOne([
                    'id' => $id
        ]);