models/RegForm.php

INSERT INTO `user` (`password_hash`, `auth_key`, `email_activation_key`, `username`, `email`, `status`, `created_at`, `updated_at`) VALUES ('$2y$13$uiN3YG5kk.OL4Adm3XvSKOAKmy4hkD3f8bM38OKl4oqvALqkoo2l.', '6jrsFZ_anrNkKZpfqMnkMERbBYsORaxh', 'oEen9y', 'admin6778999', 'admin6778999@admin.com', 1, 1490816079, 1490816079)
---
    public function reg() {
        $user = new User();
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailActivationKey();
        $user->setAttributes($this->attributes);
        if($user->save()){

INSERT INTO `email` (`type`, `status`, `recipient_email`, `data`, `created_at`, `updated_at`) VALUES (0, 3, 'admin6778999@admin.com', 'oEen9y', 1490816080, 1490816080)
---
    public function createEmail($user) {
        $email = New Email();
        $email->type = Email::EMAIL_ACTIVATE;
        $email->status = Email::STATUS_NOTSUCCSSES;
        $email->recipient_email = $user->email;
        $email->data = $user->email_activation_key;
        if($email->save()){