models/User.php

    public function getCountMessages(){
        return $this->hasMany(Message::className(), ['sender_id' => 'id'])->count();
---
SELECT COUNT(*) FROM `message` WHERE `sender_id`=1

     public function getCountNotReadMessage(){
        return $this->hasMany(Message::className(), ['recipient_id' => 'id'])->where(['status' => Message::STATUS_UNREADED])->count();
---
SELECT COUNT(*) FROM `message` WHERE (`status`=0) AND (`recipient_id`=1)

    public function addLastLogin() {
        $this->touch('last_login_date'); // last login db field
---
UPDATE `user` SET `last_login_date`=1490809475 WHERE `id`=1